IDENTIFICATION DIVISION.  
PROGRAM-ID. EXTENSO-FINALIZADO.  
DATA DIVISION.  
    WORKING-STORAGE SECTION.
        01 NUM PIC 9(6).
        01 AUXILIAR PIC 9(1).
        01 AUXILIAR-B PIC 9(1).
        01 AUXILIAR-C PIC 9(1).
        01 AUXILIAR-D PIC 9(1).
        01 AUXILIAR-E PIC 9(1).
        01 AUXILIAR-F PIC 9(1).
        01 NUMEROS-TABLE.       
            02 REG.
                05 UNIDADE-A PIC A(6) VALUE "ZERO" .          
                05 UNIDADE-B PIC A(6) VALUE "UM".          
                05 UNIDADE-C PIC A(6) VALUE "DOIS".          
                05 UNIDADE-D PIC X(6) VALUE "TRÊS".          
                05 UNIDADE-E PIC A(6) VALUE "QUATRO".          
                05 UNIDADE-F PIC A(6) VALUE "CINCO".          
                05 UNIDADE-G PIC A(6) VALUE "SEIS".          
                05 UNIDADE-H PIC A(6) VALUE "SETE".          
                05 UNIDADE-I PIC A(6) VALUE "OITO".          
                05 UNIDADE-J PIC A(6) VALUE "NOVE".      
            02 VETOR REDEFINES REG OCCURS 10 TIMES.          
                05 UNIDADES PIC X(6).      
            02 REGB.          
                05 DEZENA-A PIC A(9) VALUE "DEZ" .          
                05 DEZENA-B PIC A(9) VALUE "VINTE".          
                05 DEZENA-C PIC A(9) VALUE "TRINTA".          
                05 DEZENA-D PIC A(9) VALUE "QUARENTA".          
                05 DEZENA-E PIC A(9) VALUE "CINQUENTA".          
                05 DEZENA-F PIC A(9) VALUE "SESSENTA".          
                05 DEZENA-G PIC A(9) VALUE "SETENTA".          
                05 DEZENA-H PIC A(9) VALUE "OITENTA".          
                05 DEZENA-I PIC A(9) VALUE "NOVENTA".      
            02 VETORB REDEFINES REGB OCCURS 9 TIMES.          
                05 DEZENAS PIC A(9).      
            02 REGC.          
                05 CENTENA-A PIC A(12) VALUE "CENTO" .          
                05 CENTENA-B PIC A(12) VALUE "DUZENTOS".          
                05 CENTENA-C PIC A(12) VALUE "TREZENTOS".          
                05 CENTENA-D PIC A(12) VALUE "QUATROCENTOS".          
                05 CENTENA-E PIC A(12) VALUE "QUINHENTOS".          
                05 CENTENA-F PIC A(12) VALUE "SEISCENTOS".          
                05 CENTENA-G PIC A(12) VALUE "SETECENTOS".          
                05 CENTENA-H PIC A(12) VALUE "OITOCENTOS".          
                05 CENTENA-I PIC A(12) VALUE "NOVECENTOS".      
            02 VETORC REDEFINES REGC OCCURS 9 TIMES.
                05 CENTENAS PIC A(12).
            02 REGESPECIAL.
                05 ESPECIAL-A PIC A(9) VALUE "ONZE".
                05 ESPECIAL-A PIC A(9) VALUE "DOZE".
                05 ESPECIAL-C PIC A(9) VALUE "TREZE".
                05 ESPECIAL-D PIC A(9) VALUE "QUATORZE". 
                05 ESPECIAL-E PIC A(9) VALUE "QUINZE".    
                05 ESPECIAL-F PIC A(9) VALUE "DEZESSEIS". 
                05 ESPECIAL-G PIC A(9) VALUE "DEZESSETE". 
                05 ESPECIAL-H PIC A(9) VALUE "DEZOITO".         
                05 ESPECIAL-I PIC A(9) VALUE "DEZENOVE".
            02 VETORESPECIAL REDEFINES REGESPECIAL OCCURS 9 TIMES.  
                05 ESPECIAIS PIC A(9).  
PROCEDURE DIVISION.     
    DISPLAY "Digite um número inteiro de até seis dígitos:"     
        ACCEPT NUM.      
        IF NUM<=10
            IF NUM=1     
                DISPLAY FUNCTION TRIM(UNIDADES(2))  " REAL."
            ELSE IF NUM=10              
                DISPLAY FUNCTION TRIM(DEZENAS(1)) " REAIS."
            ELSE             
                DISPLAY FUNCTION TRIM(UNIDADES(1+NUM)) " REAIS."
        ELSE IF NUM IS GREATER THAN 10 AND LESS THAN 20        
            DISPLAY FUNCTION TRIM(ESPECIAIS(-10+NUM)) " REAIS."
        ELSE IF NUM>=20 AND NUM<100
            MOVE NUM(5:1) TO AUXILIAR
            MOVE NUM(6:1) TO AUXILIAR-B
            IF NUM(6:1) EQUAL TO "0"
                DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " REAIS."
            ELSE
                DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " REAIS."
        ELSE IF NUM=100
            DISPLAY "CEM REAIS."
        ELSE IF NUM>100 AND NUM<1000
            MOVE NUM(4:1) TO AUXILIAR
            MOVE NUM(5:1) TO AUXILIAR-B
            MOVE NUM(6:1) TO AUXILIAR-C
            IF NUM(5:2) EQUAL TO "00"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) "  REAIS."
            ELSE IF NUM(5:1) EQUAL TO "0"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " REAIS."
            ELSE IF NUM(6:1) EQUAL TO "0"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " REAIS."
            ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " REAIS."
            ELSE 
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " REAIS."
        ELSE IF NUM=1000
            DISPLAY "MIL REAIS."
        ELSE IF NUM>1000 AND NUM<10000
            MOVE NUM(3:1) TO AUXILIAR
            MOVE NUM(4:1) TO AUXILIAR-B
            MOVE NUM(5:1) TO AUXILIAR-C
            MOVE NUM(6:1) TO AUXILIAR-D
            IF NUM(4:3) EQUAL TO "000"
                DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL REAIS."
            ELSE IF NUM(4:3) EQUAL TO "100"
                DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL E CEM REAIS."
            ELSE IF NUM(4:2) EQUAL TO "00"
                DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-D)) " REAIS."
            ELSE IF NUM(5:2) EQUAL TO "00"
                    DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-B)) " REAIS."
            ELSE IF NUM(4:1) EQUAL TO "0"
                IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-C)) " REAIS."
                ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY  FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-D)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-C)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-D)) " REAIS."
            ELSE IF NUM(5:1) EQUAL TO "0"
                DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-D))" REAIS."
            ELSE IF NUM(6:1) EQUAL TO "0"
                DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-B)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-C))" REAIS."
            ELSE
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-B)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-D))" REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(UNIDADES(1+AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-B)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-C)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-D)) " REAIS."
        ELSE IF NUM=10000
            DISPLAY "DEZ MIL REAIS."
        ELSE IF NUM>10000 AND NUM<100000
            MOVE NUM(2:1) TO AUXILIAR
            MOVE NUM(3:1) TO AUXILIAR-B
            MOVE NUM(4:1) TO AUXILIAR-C
            MOVE NUM(5:1) TO AUXILIAR-D
            MOVE NUM(6:1) TO AUXILIAR-E
            IF NUM(3:4) EQUAL TO "0000"
                DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL REAIS."
            ELSE IF NUM(4:3) EQUAL TO "000"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY  FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL REAIS."
            ELSE IF NUM(3:3) EQUAL TO "000"
                DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
            ELSE IF NUM(4:3) EQUAL TO "100"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL E CEM REAIS"
                ELSE IF NUM(3:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E CEM REAIS"
                ELSE
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL E CEM REAIS."
            ELSE IF NUM(3:2) IS EQUAL TO "00"
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-E)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
            ELSE IF NUM(4:2) EQUAL TO "00"
                IF NUM (2:2) IS GREATER THAN 10 AND LESS THAN 20
                   DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
            ELSE IF NUM(5:2) EQUAL TO "00"
                IF NUM (2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " REAIS."
                ELSE IF NUM(3:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " REAIS."
            ELSE IF NUM(3:1) EQUAL TO "0"
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-E)) " REAIS."
                ELSE IF NUM(5:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL, "  FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS." 
            ELSE IF NUM(4:1) EQUAL TO "0"
                IF NUM(6:1) EQUAL TO "0"
                    IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " REAIS."
                    ELSE
                        DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " reais."
                ELSE IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-E)) " REAIS."
                    ELSE
                        DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
                ELSE
                    IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR))" E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-E)) " REAIS."
                    ELSE
                        DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR))" E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
            ELSE IF NUM(5:1) EQUAL TO "0"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
            ELSE IF NUM(6:1) EQUAL TO "0"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " REAIS."
                ELSE IF NUM(3:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " REAIS."
            ELSE
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20 AND NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-E)) " REAIS."
                ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-E)) " REAIS."
                ELSE IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(ESPECIAIS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
                ELSE
                     DISPLAY FUNCTION TRIM(DEZENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-B)) " MIL, "  FUNCTION TRIM(CENTENAS(AUXILIAR-C)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-E)) " REAIS."
        ELSE IF NUM=100000
            DISPLAY "CEM MIL REAIS."
        ELSE IF NUM>100000 AND NUM<1000000
            MOVE NUM(1:1) TO AUXILIAR
            MOVE NUM(2:1) TO AUXILIAR-B
            MOVE NUM(3:1) TO AUXILIAR-C
            MOVE NUM(4:1) TO AUXILIAR-D
            MOVE NUM(5:1) TO AUXILIAR-E
            MOVE NUM(6:1) TO AUXILIAR-F
            IF NUM(2:5) EQUAL TO "00000"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL REAIS."
            ELSE IF NUM(1:3) EQUAL TO "100"
                IF NUM(4:3) EQUAL TO "100"
                    DISPLAY "CEM MIL E CEM REAIS."
                ELSE IF NUM(4:2) EQUAL TO "00"
                    DISPLAY "CEM MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE IF NUM(5:2) EQUAL TO "00"
                    DISPLAY "CEM MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    IF NUM(4:1) EQUAL TO "0"
                        DISPLAY "CEM MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                    ELSE
                        DISPLAY "CEM MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE IF NUM(5:1) EQUAL TO "0"
                    DISPLAY "CEM MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                 ELSE IF NUM(4:1) EQUAL TO "0"
                    DISPLAY "CEM MIL, " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    IF NUM(4:1) EQUAL TO "0"
                        DISPLAY "CEM MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                    ELSE
                        DISPLAY "CEM MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE 
                    DISPLAY "CEM MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(3:4) EQUAL TO "0000"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL REAIS."
            ELSE IF NUM(2:4) EQUAL TO "0000"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F))" REAIS."
             ELSE IF NUM(4:3) EQUAL TO "100"
                IF NUM(2:2) EQUAL TO "00"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL E CEM REAIS."
                ELSE IF NUM(3:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL E CEM REAIS."
                ELSE IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL E CEM REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E CEM REAIS."
            ELSE IF NUM(4:3) EQUAL TO "000"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL REAIS."
                ELSE IF NUM(2:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL REAIS."
            ELSE IF NUM(3:3) EQUAL TO "000"
                DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(2:3) EQUAL TO "000"
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(2:2) EQUAL TO "00"
                IF NUM(5:2) EQUAL TO "00"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " REAIS." 
                ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE IF NUM(5:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(3:2) EQUAL TO "00"
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(4:2) EQUAL TO "00"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE IF NUM(2:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(5:2) EQUAL TO "00"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " REAIS."
                ELSE IF NUM(2:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " REAIS."
                ELSE IF NUM(3:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " REAIS."
            ELSE IF NUM(2:1) EQUAL TO "0"
                IF NUM(4:1) EQUAL TO "0"
                    IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                    ELSE IF NUM(6:1) EQUAL TO "0"
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                    ELSE
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE
                    IF NUM(5:1) EQUAL TO "0"
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                    ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                    ELSE IF NUM(6:1) EQUAL TO "0"
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                    ELSE 
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(3:1) EQUAL TO "0"
                IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE IF NUM(5:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(4:1) EQUAL TO "0"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                     IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                     ELSE IF NUM(6:1) EQUAL TO "0"
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                     ELSE
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS." 
                ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE IF NUM(6:1) EQUAL TO "0"
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(5:1) EQUAL TO "0"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
            ELSE IF NUM(6:1) EQUAL TO "0"
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
                ELSE 
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " REAIS."
            ELSE
                IF NUM(2:2) IS GREATER THAN 10 AND LESS THAN 20
                    IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                    ELSE
                        DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
                ELSE IF NUM(5:2) IS GREATER THAN 10 AND LESS THAN 20
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(ESPECIAIS(AUXILIAR-F)) " REAIS."
                ELSE
                    DISPLAY FUNCTION TRIM(CENTENAS(AUXILIAR)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-B)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-C)) " MIL, " FUNCTION TRIM(CENTENAS(AUXILIAR-D)) " E " FUNCTION TRIM(DEZENAS(AUXILIAR-E)) " E " FUNCTION TRIM(UNIDADES(1+AUXILIAR-F)) " REAIS."
STOP RUN.
