IDENTIFICATION DIVISION.
PROGRAM-ID. POREXTENSO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(38) VALUE ZERO.
01 NUM2 PIC 9(38) VALUE ZERO.
01 AUX PIC 9(38) VALUE 2.
01 REST PIC 9(38).
01 Q PIC 9(38) VALUE ZERO.
01 W-S.
    05 FORMATTED-INTEGER PIC Z(38).
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM ACCEPT-PARA.
    PERFORM PRIMARY-PARA.
STOP RUN.

ACCEPT-PARA.
    DISPLAY "Digite dois números inteiros:"
        ACCEPT NUM.
        ACCEPT NUM2.
    DISPLAY "Os números primos nesse intervalo são:"
    DISPLAY " ".

PRIMARY-PARA.
    PERFORM
      UNTIL NUM = NUM2
        MOVE 2 TO AUX
        ADD 1 TO NUM
        GO TO SECONDARY-PARA
    END-PERFORM.

SECONDARY-PARA.
    PERFORM
      UNTIL AUX - 1 = NUM
        IF NUM = AUX THEN
            MOVE NUM TO FORMATTED-INTEGER
            DISPLAY FUNCTION TRIM(FORMATTED-INTEGER)
            GO TO PRIMARY-PARA
        END-IF
        DIVIDE NUM BY AUX GIVING Q REMAINDER REST
        IF REST = 0 THEN
            GO TO PRIMARY-PARA
        END-IF
        ADD 1 TO AUX
    END-PERFORM
STOP RUN.
